
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//TODO: Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара", , );
	
	Если ПроверитьНаименованиеТовара(НазваниеТовара) Тогда
		Текст = СтрШаблон("Товар %1 найден", НазваниеТовара);
	Иначе
		Текст = СтрШаблон("Товар %1 не найден", НазваниеТовара);
	КонецЕсли;
	
	Сообщить(Текст);
	
КонецПроцедуры

//&НаКлиенте
Функция ПроверитьНаименованиеТовара(НазваниеТовара)

	ТоварСуществует = Справочники.Номенклатура.ПроверитьСуществованиеПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;
	
КонецФункции
