
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	ПриходнаяНакладнаяСписокНоменклатуры.Количество КАК Количество,
		|	ПриходнаяНакладнаяСписокНоменклатуры.Сумма КАК Сумма,
		|	ПриходнаяНакладнаяСписокНоменклатуры.Ссылка.Склад КАК Склад,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ПриходнаяНакладнаяСписокНоменклатуры.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.ПриходнаяНакладная.СписокНоменклатуры КАК ПриходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	ПриходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|	И НЕ ПриходнаяНакладнаяСписокНоменклатуры.Номенклатура.ГотоваяПродукция";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Движения.ОстаткиНоменклатуры.Загрузить(Запрос.Выполнить().Выгрузить());
	//тест
КонецПроцедуры
