
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).УчетнаяПолитика;
	
	Если Не ЗначениеЗаполнено(УчетнаяПолитика) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "не установлено значение учетной поритики";
		Сообщение.Сообщить();
	    Отказ = Истина;
		Возврат;
	ИначеЕсли УчетнаяПолитика = Перечисления.УчетнаяПолитика.ФИФО Тогда 
		СтрокаПорядка = " Возр ";
	ИначеЕсли УчетнаяПолитика = Перечисления.УчетнаяПолитика.ЛИФО Тогда 
		СтрокаПорядка = " Убыв ";
	КонецЕсли;
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	Движения.ОстаткиНоменклатуры.Очистить();
	Движения.ОстаткиНоменклатуры.Записать();
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК Сумма,
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка.Склад КАК Склад
		|ПОМЕСТИТЬ тДокумент
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тДокумент.Номенклатура КАК Номенклатура,
		|	тДокумент.Количество КАК Количество,
		|	тДокумент.Сумма КАК Сумма,
		|	тДокумент.Склад КАК Склад,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОст,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0) КАК СуммаОст
		|ИЗ
		|	тДокумент КАК тДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|				&ДатаОст,
		|				(Номенклатура, Склад) В
		|					(ВЫБРАТЬ
		|						тДокумент.Номенклатура КАК Номенклатура,
		|						тДокумент.Склад КАК Склад
		|					ИЗ
		|						тДокумент КАК тДокумент)) КАК ОстаткиНоменклатурыОстатки
		|		ПО тДокумент.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|			И тДокумент.Склад = ОстаткиНоменклатурыОстатки.Склад";
	
	Запрос.УстановитьПараметр("ДатаОст", ДатаОст);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Движения.ОстаткиНоменклатуры.БлокироватьДляИзменения = Истина;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаПоДокументу = СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры
