
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиНоменклатуры.Очистить();
	Движения.ОстаткиНоменклатуры.Записать();
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПередачаМатериаловВПроизводствоСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ПередачаМатериаловВПроизводствоСписокНоменклатуры.Количество) КАК Количество,
		|	ПередачаМатериаловВПроизводствоСписокНоменклатуры.Ссылка.Склад КАК Склад
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.ПередачаМатериаловВПроизводство.СписокНоменклатуры КАК ПередачаМатериаловВПроизводствоСписокНоменклатуры
		|ГДЕ
		|	ПередачаМатериаловВПроизводствоСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПередачаМатериаловВПроизводствоСписокНоменклатуры.Номенклатура,
		|	ПередачаМатериаловВПроизводствоСписокНоменклатуры.Ссылка.Склад
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&МоментВремени,
		|			Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТ_Товары.Номенклатура
		|					ИЗ
		|						ВТ_Товары КАК ВТ_Товары)
		|				И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПередачаМатериаловВПроизводствоСписокНоменклатуры.Ссылка КАК Ссылка,
		|	ПередачаМатериаловВПроизводствоСписокНоменклатуры.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ тНомерСтроки
		|ИЗ
		|	Документ.ПередачаМатериаловВПроизводство.СписокНоменклатуры КАК ПередачаМатериаловВПроизводствоСписокНоменклатуры
		|ГДЕ
		|	ПередачаМатериаловВПроизводствоСписокНоменклатуры.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Количество КАК Количество,
		|	ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ВТ_Товары.Номенклатура.Представление КАК Н,
		|	ВТ_Товары.Склад.Представление КАК С,
		|	тНомерСтроки.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_Товары.Номенклатура = ВТ_Остатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ тНомерСтроки КАК тНомерСтроки
		|		ПО ВТ_Товары.Номенклатура = тНомерСтроки.Ссылка";
	
	
	Запрос.УстановитьПараметр("МоментВремени", Неопределено);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Количество>ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Материал: " + ВыборкаДетальныеЗаписи.Н + " отсутствует в необходимом количестве, " +
			"в строке №" + ВыборкаДетальныеЗаписи.НомерСтроки + ", в наличии: " + Строка(ВыборкаДетальныеЗаписи.КоличествоОстаток);
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма = ?(ВыборкаДетальныеЗаписи.КоличествоОстаток = Движение.Количество, ВыборкаДетальныеЗаписи.СуммаОстаток, ВыборкаДетальныеЗаписи.СуммаОстаток/ВыборкаДетальныеЗаписи.КоличествоОстаток * Движение.Количество);
		
	КонецЦикла;
	
КонецПроцедуры
